app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "sub_posts" ON "posts"."id" = "sub_posts"."post_id" WHERE "sub_posts"."sub_id" = $1  [["sub_id", 2]]
---
<ul>
  <% @sub.posts.each do |post| %>