app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT "subs".id FROM "subs" INNER JOIN "sub_posts" ON "subs"."id" = "sub_posts"."sub_id" WHERE "sub_posts"."post_id" = $1  [["post_id", 4]]
---
		  <input type="hidden" name="authenticity_token" value="<%= form_authenticity_token %>">
    <% Sub.all.each do |sub| %>
       <input <%="checked" if @post.sub_ids.include?(sub.id)%> type="checkbox" name="post[sub_ids][]" value="<%=sub.id%>">