app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    post_id = @comment.post_id
    if @comment.save
---
INSERT INTO "comments" ("author_id", "content", "created_at", "parent_comment_id", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 5], ["content", "meh"], ["created_at", "2014-11-01 01:01:19.809666"], ["parent_comment_id", 1], ["post_id", 4], ["updated_at", "2014-11-01 01:01:19.809666"]]