app/controllers/posts_controller.rb

INSERT INTO "sub_posts" ("created_at", "post_id", "sub_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-31 23:55:37.120995"], ["post_id", 4], ["sub_id", 1], ["updated_at", "2014-10-31 23:55:37.120995"]]
---
  def create
    @post = current_user.posts.new(post_params)
    @post.author_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = 4  [["content", "Guys, do you guys ever stay without a cockroach more than 1 hour and how does it feel?"], ["updated_at", "2014-10-31 23:58:08.461463"]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)