app/controllers/subs_controller.rb

INSERT INTO "subs" ("created_at", "description", "moderator_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-31 21:25:01.017528"], ["description", "All about cats"], ["moderator_id", 3], ["title", "Cats"], ["updated_at", "2014-10-31 21:25:01.017528"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs"  WHERE "subs"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = 1  [["description", "All cats are soooooo cute!"], ["updated_at", "2014-10-31 21:40:42.518699"]]
---
  def update
    @sub = Sub.find(params[:id])
    redirect_to subs_path unless user_is_creator?(@sub, :moderator_id)
    if @sub.update(sub_params)